Documentation (html)/Code_Documentation/EquationParser/OperatorStack.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
 "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
  <head>
    <!-- 2025-04-21 Mo 10:01 -->
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>OperatorStack</title>
    <meta name="generator" content="Org Mode" />
  </head>
  <body>
    <div id="content" class="content">
      <h1 class="title">OperatorStack</h1>
      <div id="outline-container-org232c921" class="outline-2">
        <h2 id="org232c921">Variables</h2>
        <div class="outline-text-2" id="text-org232c921">
        </div>
        <div id="outline-container-orgc954817" class="outline-3">
          <h3 id="orgc954817">top:</h3>
          <div class="outline-text-3" id="text-orgc954817">
            <p>
              Points to the top of the stack.
            </p>
          </div>
        </div>
        <div id="outline-container-org14b3379" class="outline-3">
          <h3 id="org14b3379">debug:</h3>
          <div class="outline-text-3" id="text-org14b3379">
            <p>
              Toggles the debug prints.
            </p>
            <hr />
          </div>
        </div>
      </div>
      <div id="outline-container-org600a309" class="outline-2">
        <h2 id="org600a309">Methods</h2>
        <div class="outline-text-2" id="text-org600a309">
        </div>
        <div id="outline-container-org807a258" class="outline-3">
          <h3 id="org807a258">add():</h3>
          <div class="outline-text-3" id="text-org807a258">
            <p>
              Adds an <a href="./OperatorStackElement.html">OperatorStackElement</a> on top of the stack.
            </p>
          </div>
        </div>
        <div id="outline-container-org4993b9a" class="outline-3">
          <h3 id="org4993b9a">pop():</h3>
          <div class="outline-text-3" id="text-org4993b9a">
            <p>
              Removes one <a href="./OperatorStackElement.html">OperatorStackElement</a> from the stack.
            </p>
          </div>
        </div>
        <div id="outline-container-org394987a" class="outline-3">
          <h3 id="org394987a">cleanUp():</h3>
          <div class="outline-text-3" id="text-org394987a">
            <p>
              Removes all <a href="./OperatorStackElement.html">stack elements</a> that have a <a href="./../EquationTree/EquationNode.html">EquationNode</a> with a higher bracketDepth than the value passed to this method.
              This is necessary since these elements are in enclosed brackets, which means that they are &ldquo;done&rdquo;.
            </p>

            <p>
              <b>For example:</b>
              Given the following input &ldquo;3*(1/3)+1&rdquo; and assuming it has already been parsed up to the &ldquo;)&rdquo;.
              When returning a <a href="./OperatorStackElement.html">stack element</a> in <a href="#org0d9008e">getLast():</a> for the operator &ldquo;+&rdquo; in this case, it must search for operators on the same bracketDepth.
              That is why <a href="#org394987a">cleanUp():</a> is called at the beginning of <a href="#org0d9008e">getLast():</a>.
            </p>
          </div>
        </div>
        <div id="outline-container-org0d9008e" class="outline-3">
          <h3 id="org0d9008e">getLast():</h3>
          <div class="outline-text-3" id="text-org0d9008e">
            <p>
              This method returns the right operator given a bracketDepth and operator level. The operator level indicates the order of operators.
            </p>

            <table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


              <colgroup>
                <col  class="org-right" />

                <col  class="org-left" />
              </colgroup>
              <tbody>
                <tr>
                  <td class="org-right">level</td>
                  <td class="org-left">operators</td>
                </tr>

                <tr>
                  <td class="org-right">0</td>
                  <td class="org-left">+-</td>
                </tr>

                <tr>
                  <td class="org-right">1</td>
                  <td class="org-left">*/</td>
                </tr>

                <tr>
                  <td class="org-right">2</td>
                  <td class="org-left">^</td>
                </tr>

                <tr>
                  <td class="org-right">3</td>
                  <td class="org-left">specialFunctions</td>
                </tr>
              </tbody>
            </table>

            <p>
              In order to build a correct <a href="./../EquationTree/EquationTree.html">EquationTree</a> in the <a href="./EquationParser.html">EquationParser</a> it has to work the following way:
            </p>

            <p>
              If the given level is greater than 1 it has to return the top element.
            </p>

            <p>
              Otherwise we search for a &ldquo;better&rdquo; option (level 0).
              If it is not found, we return either the first elment containing a <a href="./../EquationTree/EquationNode.html">EquationNode</a> with the level 1 or the top element.
            </p>
          </div>
        </div>
        <div id="outline-container-org6c4580d" class="outline-3">
          <h3 id="org6c4580d">printStack():</h3>
          <div class="outline-text-3" id="text-org6c4580d">
            <p>
              A debug method for printing the stack.
            </p>
          </div>
        </div>
      </div>
    </div>
  </body>
</html>
